Practice on Income Dataset
    Define functions for the following data points
    Combined Average Income of all states from 2005 to 2013
    State with highest average income in the last three years
    State with lowest average income from 2007 to 2010(inclusive)
    Print the list of all states in the same line with average income less than California
    Print the names of states based on descending order of income in the year 2009
    State with the lowest recorded income from 2005 to 2013

In [40]:
filepath="data files/income.csv"
import pandas as pd
def readcsvdataframe(filepath):       #displaying the csv file
    return pd.read_csv(filepath)   
readcsvdataframe(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [41]:
df=readcsvdataframe(filepath)
def getcolumnindex(df,columnkey):
    for i in range(len(df.columns)):
        if df.columns[i]==columnkey:
            columnindex=i
    return columnindex
getcolumnindex(df,'2013')

10

In [42]:
def avgofstates(df,lb,ub):
    lb=getcolumnindex(df,lb)
    ub=getcolumnindex(df,ub)
    s=0
    c=0
    for i in range(len(df.values)):
        for j in range(lb,ub):
            s=s+df.values[i][j]
            c=c+1
            avg=s/c
    return avg
avgofstates(df,'2005','2013')

48326.925

In [13]:
cal=df.iloc[4,2:].mean()#  avgerage of only california bz 4:4th row and ,2: means  2-lat column
cal

55350.444444444445

# Combined Average Income of all states from 2005 to 2013

In [43]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [44]:
df.index=df['State']
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,,
Alabama,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [45]:
df.iloc[:,2:]

             2005   2006   2007   2008   2009   2010   2011   2012   2013
State
Alabama     37150  37952  42212  44476  39980  40933  42590  43464  41381
Alaska      55891  56418  62993  63989  61604  57848  57431  63648  61137
Arizona     45245  46657  47215  46914  45739  46896  48621  47044  50602
Arkansas    36658  37057  40795  39586  36538  38587  41302  39018  39919
California  51755  55319  55734  57014  56134  54283  53367  57020  57528

In [46]:
avg=df.iloc[:,2:].mean(axis=1)  # ALl States avearge from 2005 2013
avg

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       47214.777778
Arkansas      38828.888889
California    55350.444444
dtype: float64

# State with highest average income in the last three years

In [47]:
df.iloc[:,-3:]

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [48]:
df.iloc[:,-3:].mean(axis=1)#last 3 years all states average income(2007-2013)

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [49]:
df.iloc[:,-3:].mean(axis=1).idxmax() # hihest avg state within last 3 years

'Alaska'

#  State with lowest average income from 2007 to 2010(inclusive)

In [50]:
df.iloc[:,4:8]

             2007   2008   2009   2010
State
Alabama     42212  44476  39980  40933
Alaska      62993  63989  61604  57848
Arizona     47215  46914  45739  46896
Arkansas    40795  39586  36538  38587
California  55734  57014  56134  54283

In [51]:
df.iloc[:,4:8].mean()

2007    49789.8
2008    50395.8
2009    47999.0
2010    47709.4
dtype: float64

In [52]:
df.iloc[:,4:8].mean(axis=1) # 2007 -2010 avg of all states

State
Alabama       41900.25
Alaska        61608.50
Arizona       46691.00
Arkansas      38876.50
California    55791.25
dtype: float64

In [53]:
df.iloc[:,4:8].mean(axis=1).idxmin()   # lowest avg of a state in 2007-2010

'Arkansas'

# Print the list of all states in the same line with average income less than California

In [54]:
df.iloc[:,2:].mean(axis=1) #all states income from 2005-2013

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       47214.777778
Arkansas      38828.888889
California    55350.444444
dtype: float64

In [55]:
cal=df.iloc[4:,2:].mean(axis=1) #california income from 2005-2013
cal=cal[0]
cal

55350.444444444445

In [56]:
list(df[df.iloc[:,2:].mean(axis=1) < cal].index) # States with lower income with compared california in asame line

['Alabama', 'Arizona', 'Arkansas']

 # decending order of states besd on income in 2009

In [57]:
x=df.iloc[:,6] #2009 column values
x

State
Alabama       39980
Alaska        61604
Arizona       45739
Arkansas      36538
California    56134
Name: 2009, dtype: int64

In [58]:
list(x.sort_values(ascending=False).index)  #decending order of states besd on income

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

In [59]:
df.iloc[:,2:]

             2005   2006   2007   2008   2009   2010   2011   2012   2013
State
Alabama     37150  37952  42212  44476  39980  40933  42590  43464  41381
Alaska      55891  56418  62993  63989  61604  57848  57431  63648  61137
Arizona     45245  46657  47215  46914  45739  46896  48621  47044  50602
Arkansas    36658  37057  40795  39586  36538  38587  41302  39018  39919
California  51755  55319  55734  57014  56134  54283  53367  57020  57528

# stae with lowest recordrd income from 2005-2013

In [60]:
df.iloc[:,2:].idxmin() #stae with lowest recordrd income from 2005-2013

2005    Arkansas
2006    Arkansas
2007    Arkansas
2008    Arkansas
2009    Arkansas
2010    Arkansas
2011    Arkansas
2012    Arkansas
2013    Arkansas
dtype: object